# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "bramstein/webfonttools"

# Brews
brew "ansible"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/woff2"
brew "composer"
brew "curl"
brew "dnsmasq"
brew "exa"
brew "ffmpeg"
brew "flac"
brew "git-extras"
brew "git-lfs"
brew "git-secret"
brew "git", link: true
brew "gnupg"
brew "guetzli"
brew "jq"
brew "mariadb"
brew "mas"
brew "midnight-commander"
brew "minisign"
brew "mkcert"
brew "nginx-full"
brew "node@14"
brew "php", link: true
brew "pwgen"
brew "python@2", link: true
brew "python@3.9", link: true
brew "rclone"
brew "sshuttle"
brew "terraform"
brew "tldr"
brew "unp"
brew "wget"
brew "wp-cli"
brew "yarn"
brew "youtube-dl"

# Casks
cask "1password"
cask "alfred"
cask "bartender"
cask "coconutbattery"
cask "colorsnapper"
cask "contexts"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "firefox", args: { language: "de" }
cask "google-chrome-canary"
cask "google-chrome"
cask "imageoptim"
cask "imazing"
cask "iterm2"
cask "microsoft-edge-beta"
cask "microsoft-edge-dev"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "microsoft-to-do"
cask "moneymoney"
cask "numi"
cask "onedrive"
cask "osculator"
cask "poedit"
cask "qlmarkdown"
cask "qlvideo"
cask "reaper"
cask "safari-technology-preview"
cask "sequel-ace"
cask "sketch"
cask "skype"
cask "slack"
cask "sound-control"
cask "spectacle"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "tower"
cask "transmit"
cask "tripmode"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# Apps
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Battery Indicator", id: 1206020918
mas "Black Out", id: 1319884285
mas "Gifski", id: 1351639930
mas "iA Writer", id: 775737590
mas "Messenger", id: 1480068668
mas "PDF Archiver", id: 1352719750
mas "PDF Letterhead Pro", id: 1075794517
mas "Sim Daltonism", id: 693112260
mas "Telephone", id: 406825478
mas "ToothFairy", id: 1191449274

# Fonts
cask "font-arvo"
cask "font-barlow"
cask "font-cascadia"
cask "font-cooper-hewitt"
cask "font-fira-sans"
cask "font-gentium-basic"
cask "font-hack"
cask "font-ibm-flex"
cask "font-inter"
cask "font-inter"
cask "font-lato"
cask "font-merriweather"
cask "font-montserrat"
cask "font-open-sans"
cask "font-pt-sans"
cask "font-rajdhani"
cask "font-raleway"
cask "font-roboto-mono"
cask "font-roboto"
cask "font-source-sans-pro"
