# Taps
tap "blackfireio/blackfire"
tap "bramstein/webfonttools"
tap "filippo.io/age", "https://filippo.io/age"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Brews
brew "age"
brew "python@3.9"
brew "ansible"
brew "composer"
brew "coreutils"
brew "direnv"
brew "dnsmasq", restart_service: true
brew "duck"
brew "exa"
brew "flac"
brew "ffmpeg"
brew "findutils"
brew "ghostscript"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gpgme"
brew "guetzli"
brew "hcloud"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "mailhog", restart_service: true
brew "mas"
brew "midnight-commander"
brew "minisign"
brew "mkcert"
brew "mtr"
brew "mysql", restart_service: true
brew "mysql-client"
brew "nginx", restart_service: true
brew "node"
brew "node@12"
brew "node@14"
brew "nss"
brew "optipng"
brew "php", restart_service: true
brew "php@7.4", restart_service: true
brew "pinentry-mac"
brew "pwgen"
brew "rclone"
brew "rename"
brew "sshuttle"
brew "subversion"
brew "telnet"
brew "terraform"
brew "tldr"
brew "trash"
brew "unp"
brew "watch"
brew "wget"
brew "wp-cli"
brew "yarn"
brew "ykman"
brew "ykpers"
brew "youtube-dl"
brew "blackfireio/blackfire/blackfire"
brew "blackfireio/blackfire/blackfire-php74"
brew "blackfireio/blackfire/blackfire-php80"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/woff2"

# Casks
cask "1password"
cask "alfred"
cask "balenaetcher"
cask "bartender"
cask "beardedspice"
cask "browserstacklocal"
cask "coconutbattery"
cask "colorsnapper"
cask "contexts"
cask "daisydisk"
cask "discord"
cask "firefox", args: { language: "de" }
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "gimp"
cask "google-chrome"
cask "google-chrome-canary"
cask "imageoptim"
cask "imazing"
cask "insomnia"
cask "irccloud"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "lingon-x"
cask "little-snitch"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-edge-beta"
cask "microsoft-edge-dev"
cask "microsoft-office"
cask "microsoft-teams"
cask "moneymoney"
cask "mountain-duck"
cask "numi"
cask "osculator"
cask "paw"
cask "poedit"
cask "proxyman"
cask "qlmarkdown"
cask "qlvideo"
cask "reaper"
cask "rectangle"
cask "safari-technology-preview"
cask "signal"
cask "sketch"
cask "skype"
cask "slack"
cask "sound-control"
cask "spotify"
cask "steam"
cask "tableplus"
cask "telegram"
cask "the-unarchiver"
cask "tor-browser"
cask "tower"
cask "transmit"
cask "tripmode"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# Apps
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "AusweisApp2", id: 948660805
mas "Battery Indicator", id: 1206020918
mas "Black Out", id: 1319884285
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Messenger", id: 1480068668
mas "Microsoft To Do", id: 1274495053
mas "MindNode", id: 1289197285
mas "Mp3tag", id: 1532597159
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PDF Letterhead Pro", id: 1075794517
mas "PDFScanner", id: 410968114
mas "Pixave", id: 924891282
mas "Shareful", id: 1522267256
mas "Sim Daltonism", id: 693112260
mas "The Unarchiver", id: 425424353
mas "ToothFairy", id: 1191449274
mas "Xcode", id: 497799835

# Fonts
cask "font-arvo"
cask "font-asap"
cask "font-barlow"
cask "font-cooper-hewitt"
cask "font-dosis"
cask "font-fira-sans"
cask "font-fontawesome"
cask "font-gentium-basic"
cask "font-ibm-plex"
cask "font-inter"
cask "font-ionicons"
cask "font-lato"
cask "font-poppins"
cask "font-pt-sans"
cask "font-rajdhani"
cask "font-raleway"
cask "font-source-sans-pro"
cask "font-titillium"
